Day-19-pizza-shop-example/app/views/order_items/_form.html.erb

    <%= f.label :order_id %>
    <%= f.collection_select :order_id, Order.all, :id, :name %>
---
SELECT "orders".* FROM "orders"

    <%= f.label :pizza_id, "Select your pizza" %>
    <%= f.collection_select :pizza_id, Pizza.all, :id, :name %>
---
SELECT "pizzas".* FROM "pizzas"