Day-19-pizza-shop-example/app/views/order_items/index.html.erb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <tr>
        <td><%= order_item.order.name %></td>