Day-19-pizza-shop-example/app/views/order_items/show.html.erb

  <strong>Order:</strong>
  <%= @order_item.order.name %>
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]