Day-19-pizza-shop-example/app/views/orders/show.html.erb

  <%= @order.name %>
  <%= @order.pizzas.first.name %>
---
SELECT  "pizzas".* FROM "pizzas" INNER JOIN "order_items" ON "pizzas"."id" = "order_items"."pizza_id" WHERE "order_items"."order_id" = $1 ORDER BY "pizzas"."id" ASC LIMIT $2  [["order_id", 3], ["LIMIT", 1]]