Day-19-pizza-shop-example/app/views/pizzas/_form.html.erb

SELECT "toppings".* FROM "toppings"
---
    <%= f.label :topping_ids %>
    <%= f.collection_select :topping_ids, Topping.all, :id, :name, {},
    {:multiple => true} %>