Day-19-pizza-shop-example/app/views/pizzas/show.html.erb

SELECT "toppings".* FROM "toppings" INNER JOIN "pizzas_toppings" ON "toppings"."id" = "pizzas_toppings"."topping_id" WHERE "pizzas_toppings"."pizza_id" = $1  [["pizza_id", 1]]
---
  <ul>
    <% @pizza.toppings.each do |t| %>