Project-2a/project-2a-answers/app/controllers/home_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at desc
---
  def index
    @posts = Post.all.order('created_at desc')