Project-2a/project-2a-answers/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at desc
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "The Title"], ["body", "The Post Body"], ["user_id", 1], ["created_at", 2016-06-24 06:04:29 UTC], ["updated_at", 2016-06-24 06:04:29 UTC]]
---
  def create
    @post = current_user.posts.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Updated Title"], ["body", "Updated Body"], ["updated_at", 2016-06-24 06:04:29 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)