Day-19-pizza-shop-example/app/controllers/order_items_controller.rb

  def index
    @order_items = OrderItem.all
---
SELECT "order_items".* FROM "order_items"

  def create
    @order_item = OrderItem.new(order_item_params)

    respond_to do |format|
      if @order_item.save
---
INSERT INTO "order_items" ("order_id", "pizza_id", "price", "size", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["order_id", 1], ["pizza_id", 1], ["price", #<BigDecimal:7ffbbfcc1448,'0.599E1',18(18)>], ["size", 16], ["created_at", 2016-06-23 06:28:13 UTC], ["updated_at", 2016-06-23 06:28:13 UTC]]

    def set_order_item
      @order_item = OrderItem.find(params[:id])
---
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]