Day-19-pizza-shop-example/app/controllers/pizzas_controller.rb

SELECT "pizzas".* FROM "pizzas"
---
  def index
    @pizzas = Pizza.all

INSERT INTO "pizzas" ("name", "cheese", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "bbq"], ["cheese", true], ["created_at", 2016-06-21 09:20:18 UTC], ["updated_at", 2016-06-21 09:20:18 UTC]]
---
  def create
    @pizza = Pizza.new(params.require(:pizza).permit(:name, :topping_ids => []))

    respond_to do |format|
      if @pizza.save

DELETE FROM "pizzas" WHERE "pizzas"."id" = $1  [["id", 1]]
---
  def destroy
    @pizza.destroy

SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_pizza
      @pizza = Pizza.find(params[:id])