Day-19-pizza-shop-example/app/views/customers/show.html.erb

<h1>Orders</h1>
<% @customer.orders.each do |order| %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = $1  [["customer_id", 1]]